{
  "when": "2011-12-22T01:43:37-05:00", 
  "message": "Updating mediator catalog", 
  "who": "hiranya", 
  "changes": [
    {
      "chunks": [
        {
          "locn": "-50,6 +50,74", 
          "lines": [
            "                     and patterns\n", 
            "                 </li>\n", 
            "             </ul>\n", 
            "+            <p>\n", 
            "+                Rest of this article is structured according to the above classification. Mediators\n", 
            "+                in each section are arranged in the alphabetical order.\n", 
            "+            </p>\n", 
            "         </section>\n", 
            "+        <section name=\"Core Mediators\" id=\"CoreMediators\">\n", 
            "+            <subsection name=\"Drop Mediator\" id=\"Drop\">\n", 
            "+                <p>\n", 
            "+                    Drop mediator can be used to drop the current message being processed and\n", 
            "+                    terminate a message flow. This mediator is configured as follows and it\n", 
            "+                    does not take any additional parameters or arguments.\n", 
            "+                </p>\n", 
            "+                <div class=\"xmlConf\">&lt;drop/&gt;</div>\n", 
            "+            </subsection>\n", 
            "+            <subsection name=\"Log Mediator\" id=\"Log\">\n", 
            "+                <p>\n", 
            "+                    Log mediator can be used in any sequence or proxy service to log the messages\n", 
            "+                    being mediated. Log entries generated by the log mediator will go into the\n", 
            "+                    standard Synapse log files. This can be further configured using the\n", 
            "+                    log4j.properties file.\n", 
            "+                </p>\n", 
            "+                <p>\n", 
            "+                    By default the log mediator only logs a minimalistic set of details to avoid\n", 
            "+                    the message content being parsed. But if needed it can be configured to log the\n", 
            "+                    full message payload, headers and even custom user defined properties. The log\n", 
            "+                    mediator configuration takes the following general form.\n", 
            "+                </p>\n", 
            "+                <div class=\"xmlConf\">&lt;log [level=\"simple|full|headers|custom\"] [separator=\"string\"]\n", 
            "+                    [category=\"INFO|DEBUG|WARN|ERROR|TRACE|FATAL\"]&gt;\n", 
            "+    &lt;property name=\"string\" (value=\"literal\" | expression=\"xpath\")/&gt;*\n", 
            "+&lt;/log&gt;</div>\n", 
            "+                <p>\n", 
            "+                    The 'level' attribute is used to specify how much information should be logged\n", 
            "+                    by the log mediator. This attribute can take one of following four values.\n", 
            "+                </p>\n", 
            "+                <ul>\n", 
            "+                    <li>\n", 
            "+                        simple - Logs a set of standard headers (To, From, WSAction, SOAPAction,\n", 
            "+                        ReplyTo and MessageID). If no log level is specified, this level will be\n", 
            "+                        used by default.\n", 
            "+                    </li>\n", 
            "+                    <li>\n", 
            "+                        full - Logs all standard headers logged in the log level 'simple' and also\n", 
            "+                        the full payload of the message. This log level causes the message content\n", 
            "+                        to be parsed and hence incurs a performance overhead.\n", 
            "+                    </li>\n", 
            "+                    <li>\n", 
            "+                        headers - Logs all SOAP header blocks\n", 
            "+                    </li>\n", 
            "+                    <li>\n", 
            "+                        custom - Only logs the user defined properties (see the next section)\n", 
            "+                    </li>\n", 
            "+                </ul>\n", 
            "+                <p>\n", 
            "+                    Users can define custom attributes and properties to be logged by the log mediator\n", 
            "+                    by specifying some 'property' elements. Each property must be named, and can\n", 
            "+                    have a constant value or an XPath expression. If a constant value is specified,\n", 
            "+                    that value will be logged with each and every entry logged by the mediator. If\n", 
            "+                    an XPath is specified instead, that XPath will be evaluated on the message being\n", 
            "+                    mediated and the outcome will be included in the generated log entry.\n", 
            "+                </p>\n", 
            "+                <p>\n", 
            "+                    By default all properties and attributes logged by the log mediator are separated\n", 
            "+                    by commas (,). This can be configured using the 'separator' attribute. Further\n", 
            "+                    all logs generated by the mediator are logged at log4j log level 'INFO' by default.\n", 
            "+                    This behavior can also be configured using the 'category' attribute.\n", 
            "+                </p>\n", 
            "+            </subsection>\n", 
            "+        </section>\n", 
            "     </body>\n", 
            " </document>\n", 
            "\\ No newline at end of file\n"
          ]
        }
      ], 
      "to": "scratch/hiranya/website/src/site/xdoc/userguide/mediators.xml", 
      "from": "scratch/hiranya/website/src/site/xdoc/userguide/mediators.xml"
    }
  ], 
  "id": "1222067"
}