{
  "when": "2016-12-28T20:39:42-05:00", 
  "message": "Fix for SYNAPSE-1082 by Prabath", 
  "who": "isudana", 
  "changes": [
    {
      "chunks": [
        {
          "locn": "-258,11 +258,24", 
          "lines": [
            "                 </li>\n", 
            "                 <p/>\n", 
            "                 <li>\n", 
            "+                    What is the Passthrough transport?\n", 
            "+                    <ul>\n", 
            "+                        <li>\n", 
            "+                            This is the default HTTP transport used by Apache Synapse. HTTP PassThrough Transport\n", 
            "+                            is a non-blocking HTTP transport implementation based on HTTP Core NIO and specially\n", 
            "+                            designed for streaming messages. It is similar to the old message relay transport,\n", 
            "+                            but it does not care about the content type and simply streams all received messages\n", 
            "+                            through. It also has a simpler and cleaner model for forwarding messages back and forth.\n", 
            "+                            It can be used as an alternative to the NHTTP transport.\n", 
            "+                        </li>\n", 
            "+                    </ul>\n", 
            "+                </li>\n", 
            "+                <p/>\n", 
            "+                <li>\n", 
            "                     What is the NHTTP transport?\n", 
            "                     <ul>\n", 
            "                         <li>\n", 
            "-                           This is the default HTTP transport used by Apache Synapse. NHTTP stands for\n", 
            "-                            non-blocking HTTP. NHTTP transport uses the Java Non-blocking I/O API.\n", 
            "+                            NHTTP stands for non-blocking HTTP. NHTTP transport uses the Java Non-blocking I/O API.\n", 
            "                             This allows the NHTTP transport to scale into handling hundreds of connections\n", 
            "                             without blocking the threads. The server worker threads used by the NHTTP\n", 
            "                             transport do not get blocked on I/O until the Synapse receives responses\n"
          ]
        }, 
        {
          "locn": "-273,7 +286,7", 
          "lines": [
            "                 </li>\n", 
            "                 <p/>\n", 
            "                 <li>\n", 
            "-                    What is the underlying HTTP library used by the NHTTP transport?\n", 
            "+                    What is the underlying HTTP library used by the NHTTP/Passthrough transport?\n", 
            "                     <ul>\n", 
            "                         <li>\n", 
            "                            NHTTP transport uses the Apache Http Core NIO library underneath. This\n"
          ]
        }
      ], 
      "to": "java/modules/documentation/src/site/xdoc/userguide/faq.xml", 
      "from": "java/modules/documentation/src/site/xdoc/userguide/faq.xml"
    }
  ], 
  "id": "1776367"
}