{
  "when": "2016-12-28T20:36:53-05:00", 
  "message": "Fix for SYNAPSE-1086 by Vanji", 
  "who": "isudana", 
  "changes": [
    {
      "chunks": [
        {
          "locn": "-36,7 +36,7", 
          "lines": [
            "             <p>\n", 
            "                 If you are an experienced Synapse developer or already a committer\n", 
            "                 for Synapse, this document might still contain useful information on setting up\n", 
            "-                your working copy of the source code and committing code changes. So feel free to\n", 
            "+                your working copy of the source code and committing code changes. So, feel free to\n", 
            "                 read all the way through.\n", 
            "             </p>\n", 
            "         </section>\n"
          ]
        }, 
        {
          "locn": "-70,7 +70,7", 
          "lines": [
            "         </section>\n", 
            "         <section name=\"Interacting with the Code Base Using Subversion\" id=\"subversion\">\n", 
            "             <p>\n", 
            "-                Synapse code base is maintained in a Subversion repository. Therefore anybody willing\n", 
            "+                Synapse code base is maintained in a Subversion repository. Therefore, anyone willing\n", 
            "                 to go through the Synapse source code in the development trunk and make contributions\n", 
            "                 should use a Subversion client to interact with the Synapse code base. To learn more\n", 
            "                 about using Subversion or to download the latest client distributions, please visit\n"
          ]
        }, 
        {
          "locn": "-132,13 +132,13", 
          "lines": [
            "                 <p>\n", 
            "                     Developers and committers making changes to the Synapse code base are highly\n", 
            "                     recommended to always build the source 'WITH' the tests. This will ensure that\n", 
            "-                    changes do not introduce any obvious regression errors. However running all the\n", 
            "+                    changes do not introduce any obvious regression errors. However, running all the\n", 
            "                     tests does not guarantee that a particular change will not introduce any\n", 
            "-                    regressions. Therefore care must be exercised whenever making changes to the\n", 
            "+                    regressions. Therefore, care must be exercised whenever making changes to the\n", 
            "                     existing code.\n", 
            "                 </p>\n", 
            "                 <p>\n", 
            "-                    Synapse source tree is organized into several modules. If required you can build\n", 
            "+                    Synapse source tree is organized into several modules. If required, you can build\n", 
            "                     only a selected module by going into the appropriate module and executing one\n", 
            "                     of the above build commands.\n", 
            "                 </p>\n"
          ]
        }, 
        {
          "locn": "-169,7 +169,7", 
          "lines": [
            "                     run the usual Maven build command.\n", 
            "                 </p>\n", 
            "                 <p>\n", 
            "-                    Synapse integration test suite uses the Maven Surefire plugin. Therefore all\n", 
            "+                    Synapse integration test suite uses the Maven Surefire plugin. Therefore, all\n", 
            "                     tests will generate a report which will be available in the\n", 
            "                     modules/integration/target/surefire-reports directory. If you ever encounter\n", 
            "                     a failure while running the integration tests, this is the first place to check.\n"
          ]
        }
      ], 
      "to": "java/modules/documentation/src/site/xdoc/dev/developer-guide.xml", 
      "from": "java/modules/documentation/src/site/xdoc/dev/developer-guide.xml"
    }
  ], 
  "id": "1776366"
}