{
  "when": "2016-12-28T20:32:34-05:00", 
  "message": "Fix for SYNAPSE-1084 by Vanji", 
  "who": "isudana", 
  "changes": [
    {
      "chunks": [
        {
          "locn": "-154,7 +154,7", 
          "lines": [
            "                     log4j.properties file.\n", 
            "                 </p>\n", 
            "                 <p>\n", 
            "-                    By default the log mediator only logs a minimalistic set of details to avoid\n", 
            "+                    By default, the log mediator only logs a minimalistic set of details to avoid\n", 
            "                     the message content being parsed. But if needed it can be configured to log the\n", 
            "                     full message payload, headers and even custom user defined properties. The log\n", 
            "                     mediator configuration takes the following general form.\n"
          ]
        }, 
        {
          "locn": "-194,7 +194,7", 
          "lines": [
            "                     mediated and the outcome will be included in the generated log entry.\n", 
            "                 </p>\n", 
            "                 <p>\n", 
            "-                    By default all properties and attributes logged by the log mediator are separated\n", 
            "+                    By default, all properties and attributes logged by the log mediator are separated\n", 
            "                     by commas (,). This can be configured using the 'separator' attribute. Further\n", 
            "                     all logs generated by the mediator are logged at log4j log level 'INFO' by default.\n", 
            "                     This behavior can also be configured using the 'category' attribute.\n"
          ]
        }, 
        {
          "locn": "-236,7 +236,7", 
          "lines": [
            "                     on the message to determine the value that needs to be assigned to the property.\n", 
            "                 </p>\n", 
            "                 <p>\n", 
            "-                    Synapse properties are scoped. Therefore when using this mediator the user should\n", 
            "+                    Synapse properties are scoped. Therefore, when using this mediator the user should\n", 
            "                     specify the scope at which the property will be set or removed from. If not\n", 
            "                     specified, property mediator will work at the 'default' scope. Properties set in\n", 
            "                     this scope last as long as the transaction (request-response) exists. Properties\n"
          ]
        }, 
        {
          "locn": "-260,7 +260,7", 
          "lines": [
            "                     alter the behavior of the underlying Axis2 engine and transports framework.\n", 
            "                 </p>\n", 
            "                 <p>\n", 
            "-                    By default property mediator sets all property values as strings. It is possible\n", 
            "+                    By default, property mediator sets all property values as strings. It is possible\n", 
            "                     to set properties in other types by specifying the 'type' attribute. This attribute\n", 
            "                     can accept one of following values.\n", 
            "                 </p>\n"
          ]
        }, 
        {
          "locn": "-358,7 +358,7", 
          "lines": [
            "                     filter mediator will execute the enclosed child mediators.\n", 
            "                 </p>\n", 
            "                 <p>\n", 
            "-                    Alternatively one can use the following syntax to configure the filter mediator.\n", 
            "+                    Alternatively, one can use the following syntax to configure the filter mediator.\n", 
            "                 </p>\n", 
            "                 <div class=\"xmlConf\">&lt;filter (source=\"xpath\" regex=\"string\") | xpath=\"xpath\"&gt;\n", 
            "     &lt;then [sequence=\"string\"]&gt;\n"
          ]
        }, 
        {
          "locn": "-369,7 +369,7", 
          "lines": [
            "     &lt;/else&gt;\n", 
            " &lt;/filter&gt;</div>\n", 
            "                 <p>\n", 
            "-                    In this case too the filter condition is evaluated in the same manner as\n", 
            "+                    In this case also the filter condition is evaluated in the same manner as\n", 
            "                     described above. Messages for which the condition evaluates to true will be\n", 
            "                     mediated through the mediators enclosed by the 'then' element. Failed messages\n", 
            "                     will be mediated through the mediators enclosed by the 'else' element.\n"
          ]
        }, 
        {
          "locn": "-393,7 +393,7", 
          "lines": [
            "     mediator+\n", 
            " &lt;/out&gt;</div>\n", 
            "                 <p>\n", 
            "-                    In mediator will process requests through the child mediators anf the Out\n", 
            "+                    In mediator will process requests through the child mediators and the Out\n", 
            "                     mediator will process responses through the child mediators.\n", 
            "                 </p>\n", 
            "             </subsection>\n"
          ]
        }, 
        {
          "locn": "-413,8 +413,8", 
          "lines": [
            "                 <p>\n", 
            "                     The source XPath is executed on the messages. The resulting value is then\n", 
            "                     tested against the regular expressions defined in each 'case' element. When\n", 
            "-                    a matching case is found the message will be mediated through its child\n", 
            "-                    mediators. If none of the cases match, the message will handed to the 'default'\n", 
            "+                    a matching case is found, the message will be mediated through its child\n", 
            "+                    mediators. If none of the cases match, the message will be handed to the 'default'\n", 
            "                     case (if available).\n", 
            "                 </p>\n", 
            "             </subsection>\n"
          ]
        }, 
        {
          "locn": "-527,7 +527,7", 
          "lines": [
            "                     mediator takes the value of the specified property as the input URL.\n", 
            "                 </p>\n", 
            "                 <p>\n", 
            "-                    Similarly the mediator by default sets the transformed URL as the 'To' header of\n", 
            "+                    Similarly, the mediator by default sets the transformed URL as the 'To' header of\n", 
            "                     the message and alternatively you can use the 'outProperty' attribute to\n", 
            "                     instruct the mediator to set the resulting URL as a property.\n", 
            "                 </p>\n"
          ]
        }, 
        {
          "locn": "-749,7 +749,7", 
          "lines": [
            " &lt;/script&gt;</div>\n", 
            "                 <p>\n", 
            "                     The execution context environment of the script has access to the Synapse\n", 
            "-                    MessageContext predefined in a script variable named 'mc' . An example of\n", 
            "+                    MessageContext predefined in a script variable named 'mc'. An example of\n", 
            "                     an inline mediator using JavaScript/E4X which returns false if the SOAP\n", 
            "                     message body contains an element named 'symbol' which has a value of 'IBM'\n", 
            "                     would be:\n"
          ]
        }, 
        {
          "locn": "-771,7 +771,7", 
          "lines": [
            "                     benefit of some scripting languages is that they have very simple and\n", 
            "                     elegant XML manipulation capabilities, for example JavaScript E4X or Ruby\n", 
            "                     REXML, so this makes them well suited for use in the Synapse mediation\n", 
            "-                    environment. For both types of script mediator definition the\n", 
            "+                    environment. For both types of script mediator definition, the\n", 
            "                     MessageContext passed into the script has additional methods over the\n", 
            "                     standard Synapse MessageContext to enable working with the XML in a way\n", 
            "                     natural to the scripting language. For example when using JavaScript\n"
          ]
        }
      ], 
      "to": "java/modules/documentation/src/site/xdoc/userguide/mediators.xml", 
      "from": "java/modules/documentation/src/site/xdoc/userguide/mediators.xml"
    }
  ], 
  "id": "1776364"
}